<!-- dflook/terraform-github-actions {"workspace":"fallback-to-terraform","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"3d48c0a6bb80f8a0ed3872808556cf2af057c9cc166500697bdee84837553926","plan_job_ref":"Job Test plan target and replace #366 at https://github.com/dflook/terraform-github-actions/actions/runs/6683921720","plan_hash":"c4d7df782fe0ae2eaf6b40c0c5f217d6751064ddca391fe313b88211e50edbe4","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fallback-to-terraform__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "Y4PhxfpjVF" -> (known after apply)
  ~ foreach = "Af8lkztr6I" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #366](https://github.com/dflook/terraform-github-actions/actions/runs/6683921720)